{
  "backend/main.mo": "Main Motoko actor implementing a banking backend with user profile management and balance operations (deposit, withdraw, transfer), protected by role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting that the fallback default balance in the useBalance hook was updated from 1000 to 211239, with references to the affected file and test ID REQ-2.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties (design tokens) for light and dark themes including colors, radius, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the BlueStone Bank frontend app, mounting the React app at the #root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with six routes, hardcoded session-based authentication (email/password stored in localStorage), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/AccountsOverview.tsx": "Displays a checking account summary card with live balance from the useBalance hook, a skeleton loader, and an informational note about real-time balance updates.",
  "frontend/src/components/BalanceCard.tsx": "Balance display card with a dark navy gradient, show/hide balance toggle, decorative circles, account number hint, and optional user name greeting.",
  "frontend/src/components/DebitCard.tsx": "Visual debit card component styled as a BlueStone Bank card with chip, masked/revealed card number toggle, cardholder name, expiry, and VISA branding.",
  "frontend/src/components/DepositForm.tsx": "A form component for depositing funds that validates the amount, shows a confirmation dialog, and calls the deposit mutation with toast notifications on success or failure.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with navigation links and login button, a mobile hamburger menu, main content slot, and a footer.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/MobileBalanceCard.tsx": "Displays the user's checking account balance with a toggle to show or hide it, along with a time-based greeting.",
  "frontend/src/components/MobileBottomNav.tsx": "A fixed bottom navigation bar for mobile with tabs for Home, Accounts, Pay, and More, navigating to routes or showing a 'coming soon' toast.",
  "frontend/src/components/MobileQuickActions.tsx": "Renders a grid of quick-action buttons (Deposit, Withdraw, Transfer, Pay Bills) that navigate to their respective routes or show a 'coming soon' toast.",
  "frontend/src/components/MobileRecentTransactions.tsx": "Shows the five most recent transactions with icons, descriptions, dates, and color-coded amounts, including skeleton loading states and an empty state.",
  "frontend/src/components/MobileTopBar.tsx": "A sticky mobile header displaying the BlueStone Bank brand, a notification bell with a badge, and an optional logout button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email on first login, validates inputs, and saves the profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/QuickActions.tsx": "Renders a 4-button grid of quick action shortcuts (Transfer, Deposit, Bill Pay, Top-up) that either navigate to a route or show a 'Coming Soon' toast notification.",
  "frontend/src/components/RecentTransactionsList.tsx": "Displays a styled list of recent transactions with icons, amounts, and dates, showing skeletons while loading and an empty state when there are no transactions.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "A modal alert dialog that shows a summary of a pending deposit, withdrawal, or transfer and lets the user confirm or cancel, with a loading spinner during processing.",
  "frontend/src/components/TransactionFilters.tsx": "Renders two Select dropdowns for filtering transactions by type (all/deposit/withdrawal/transfer) and sorting by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "Displays a paginated, card-style list of transactions with icons, badges, formatted amounts, and dates, plus an empty state when no transactions match.",
  "frontend/src/components/TransferForm.tsx": "A form for initiating an external transfer that validates the recipient Principal ID and amount against the available balance, then triggers a confirmation dialog before executing the transfer mutation.",
  "frontend/src/components/VirtualCard.tsx": "Renders a flippable 3D virtual debit card UI showing cardholder name, masked card number, expiry on the front, and a CVV strip on the back.",
  "frontend/src/components/WithdrawForm.tsx": "React form component for withdrawing funds that validates the amount against the available checking balance, shows a confirmation dialog, and calls the useWithdraw mutation with success/error toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBalance.ts": "Custom hook that fetches the user's checking balance from the backend actor via React Query, returning a default balance of $2,112.39 when no data is available.",
  "frontend/src/hooks/useFilteredTransactions.ts": "Custom hook that memoizes filtering and sorting of a transaction list by type and sort option (date or amount, ascending or descending).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for deposit, withdraw, and external transfer operations against the backend actor, each invalidating the balance query on success.",
  "frontend/src/hooks/useTransactions.ts": "Defines transaction types and returns a static list of mock transactions (deposits, withdrawals, transfers) since the backend has no transaction history endpoint.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for reading and saving a local user profile (name and email) stored in localStorage, since the backend does not support profile storage.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/components/utilities, a Chase Bank-inspired CSS custom property color system for light and dark modes, and utility styles for card flip animation, balance blur, and custom scrollbar.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccountsPage.tsx": "Page component displaying the accounts overview with a back-navigation header and bottom navigation bar.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that composes the top bar, balance card, debit card, quick actions, recent transactions, and bottom navigation into a mobile-first layout.",
  "frontend/src/pages/DepositPage.tsx": "Page component that renders the DepositForm with a header and navigates back to the home route on successful deposit.",
  "frontend/src/pages/LoginPage.tsx": "Renders the BlueStone Bank login page with email/password form fields, error display, and a loading state during sign-in submission.",
  "frontend/src/pages/TransactionHistory.tsx": "Displays a paginated, filterable, and sortable transaction history page using custom hooks and TransactionTable/TransactionFilters components.",
  "frontend/src/pages/TransferPage.tsx": "Page wrapper for fund transfers that renders a header with back navigation and embeds the TransferForm component.",
  "frontend/src/pages/WithdrawPage.tsx": "Page wrapper for withdrawals that renders a header with back navigation and embeds the WithdrawForm component.",
  "frontend/src/utils/formatters.ts": "Provides utility functions for formatting currency (cents to USD), dates, relative dates, and transaction type labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback.",
  "frontend/src/utils/validation.ts": "Exports validation functions for amount, Principal ID, and email fields, returning error message strings.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom Chase Bank color tokens, fonts, shadows, border radii, and animations.",
  "project_state.json": "Tracks project state and feature requests, currently recording a pending task to update the default starting balance from 1000 to 211239 in both frontend and backend."
}