{
  "backend/main.mo": "Main Motoko actor implementing a banking backend with user profile management and wallet operations (deposit, withdrawal, transfer), protected by role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting a single completed feature: removing the bank logo image from the DebitCard component's top-right corner and restoring the original branding content.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, card, primary, destructive, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the BlueStone Bank SPA, mounting the React app at the #root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with five routes (dashboard, deposit, withdraw, transfer, transactions), implements a hardcoded-credential login portal with email/password validation, and gates app access behind either a temporary session or Internet Identity authentication.",
  "frontend/src/components/AccountsOverview.tsx": "Displays a two-card grid showing Checking and Savings account balances with masked account numbers, gradient backgrounds, and loading skeletons; checking balance is fetched live while savings uses a hardcoded dummy value.",
  "frontend/src/components/BalanceCard.tsx": "Dark navy gradient card component showing the user's total checking account balance with a show/hide toggle, decorative circles, a trending-up indicator, and a masked account number hint.",
  "frontend/src/components/DebitCard.tsx": "Renders a styled virtual debit card UI with an EMV chip, bank name, and a toggleable card number that switches between masked and full display.",
  "frontend/src/components/DepositForm.tsx": "A deposit form component that validates amount input, shows a confirmation dialog, and submits the deposit mutation before navigating back to the home page.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with navigation links and login button, responsive mobile menu, main content slot, and a footer with social links.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/MobileBalanceCard.tsx": "Displays the authenticated user's greeting and current account balance with a toggle to show or hide the balance value, using skeleton loading states.",
  "frontend/src/components/MobileBottomNav.tsx": "A fixed bottom navigation bar for mobile with Home, Accounts, Payments, and More tabs; navigates to the home route or shows a 'coming soon' toast for unimplemented tabs.",
  "frontend/src/components/MobileQuickActions.tsx": "Renders a row of quick-action buttons (Transfer, Deposit, Withdraw, Pay Bills) that navigate to their respective routes or show a 'coming soon' toast.",
  "frontend/src/components/MobileRecentTransactions.tsx": "Displays the five most recent transactions with type-specific icons, relative dates, and credit/debit formatting, including skeleton loaders and an empty state.",
  "frontend/src/components/MobileTopBar.tsx": "Renders a mobile top bar with a hamburger menu button, the Bluestone Bank brand name/tagline, and a notification bell with an optional badge count.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects name, email, and password to create a new user profile, with validation and submission via the useSaveCallerUserProfile hook.",
  "frontend/src/components/QuickActions.tsx": "Displays a 4-button grid of quick banking actions (Transfer, Deposit, Bill Pay, Top-up), navigating to routes for active features and showing a toast for coming-soon ones.",
  "frontend/src/components/RecentTransactionsList.tsx": "Shows a list of recent transactions with icons, labels, and formatted amounts/dates, including a skeleton loading state and a link to the full transactions page.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "An alert dialog that displays a summary of a pending transaction (type, amount, recipient, description) and lets the user confirm or cancel, with a loading spinner during processing.",
  "frontend/src/components/TransactionFilters.tsx": "Renders two select dropdowns for filtering transactions by type and sorting them by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "Displays a paginated table of transactions with type icons, badges, descriptions, dates, and color-coded amounts, falling back to an empty-state card when there are no results.",
  "frontend/src/components/TransferForm.tsx": "A form component for transferring funds to another user by Principal ID, with amount/principal validation, optional description, and a confirmation dialog before executing the transfer mutation.",
  "frontend/src/components/VirtualCard.tsx": "A flippable virtual credit card UI component displaying cardholder name, masked card number, expiry, and a styled back face with CVV on click.",
  "frontend/src/components/WithdrawForm.tsx": "A form component for withdrawing funds, with amount validation, optional description, and a confirmation dialog before executing the withdrawal mutation.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries when the Internet Identity changes.",
  "frontend/src/hooks/useBalance.ts": "A React Query hook that fetches the user's account balance from the backend actor, falling back to a hardcoded mock balance on error or when unauthenticated.",
  "frontend/src/hooks/useFilteredTransactions.ts": "A hook that provides client-side filtering by transaction type and sorting (by date or amount) over a given transactions array using memoization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutation hooks for account initialization, deposit, withdrawal, and transfer operations, each invalidating balance and transaction caches on success.",
  "frontend/src/hooks/useTransactions.ts": "A React Query hook that fetches transaction history from the backend actor, falling back to hardcoded mock transactions when the backend returns an empty list or errors.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching (`useGetCallerUserProfile`) and saving (`useSaveCallerUserProfile`) the current user's profile via the backend actor.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, CSS custom properties for a dark-navy and gold banking theme (light and dark modes), and card-flip/balance-toggle animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that initializes the user account if needed, then renders the mobile-layout components: top bar, balance card, debit card, quick actions, recent transactions, and bottom nav.",
  "frontend/src/pages/DepositPage.tsx": "Page wrapper for depositing funds, containing a back-navigation button and the DepositForm component.",
  "frontend/src/pages/TransactionHistory.tsx": "Page that fetches and displays all transactions with filtering and sorting controls via TransactionFilters and TransactionTable components.",
  "frontend/src/pages/TransferPage.tsx": "Page wrapper for transferring funds to another user, containing a back-navigation button and the TransferForm component.",
  "frontend/src/pages/WithdrawPage.tsx": "Page wrapper for withdrawing funds, containing a back-navigation button and the WithdrawForm component.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting bigint values as USD currency, nanosecond timestamps as human-readable dates, and capitalizing transaction type strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/src/utils/validation.ts": "Validation helpers for amount strings, ICP Principal IDs, and email addresses, each returning a typed ValidationResult object.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based color tokens (navy, gold, chart colors), custom border radii, box shadows, font families, and animation keyframes.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a fix request to remove the bank logo image from the DebitCard component and restore the original branding content."
}