{
  "backend/main.mo": "Main Motoko actor implementing a banking backend with user profile management and wallet operations (deposit, withdrawal, transfer), protected by role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard redesign, virtual card, quick actions, transaction list, etc.) to their corresponding source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of every frontend source file, serving as a reference index for the project's React components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the BlueStone Bank React SPA, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root application file that configures TanStack Router with all page routes, wraps the app in ThemeProvider and Toaster, and renders a two-panel branded LoginPortal when the user is unauthenticated.",
  "frontend/src/components/AccountsOverview.tsx": "Dashboard component that displays Checking and Savings account cards with navy gradient styling, masked account numbers, live balance fetched via React Query, and loading skeletons.",
  "frontend/src/components/BalanceCard.tsx": "Displays a styled bank balance card with a toggle to show/hide the balance amount, decorative UI elements, and a static account number hint.",
  "frontend/src/components/DepositForm.tsx": "Form component for submitting a deposit with amount and optional description fields, including validation and a confirmation dialog before executing the transaction.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapper providing a sticky header with navigation links and login button (desktop and mobile), a main content area, and a footer.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate loading/authenticated states and clearing the React Query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create a profile by entering name, email, and password, with validation and submission via the saveCallerUserProfile mutation.",
  "frontend/src/components/QuickActions.tsx": "Grid of quick-action buttons for Transfer, Deposit, Bill Pay, and Top-up, navigating to the relevant route or showing a 'coming soon' toast for unimplemented features.",
  "frontend/src/components/RecentTransactionsList.tsx": "Displays a list of recent transactions with type-specific icons and color-coded amounts, showing skeleton placeholders while loading and an empty state when no transactions exist.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "An alert dialog component that displays transaction details (type, amount, recipient, description) for user confirmation before processing, with a loading state during submission.",
  "frontend/src/components/TransactionFilters.tsx": "A card component providing two select dropdowns to filter transactions by type (all/deposit/withdrawal/transfer) and sort them by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "Renders a table of transactions with type icons, badges, descriptions, formatted dates, and color-coded amounts; shows an empty state message when no transactions exist.",
  "frontend/src/components/TransferForm.tsx": "A form for initiating fund transfers that validates recipient Principal ID and amount, then shows a confirmation dialog before executing the transfer mutation and navigating home on success.",
  "frontend/src/components/VirtualCard.tsx": "A flippable virtual credit card UI component displaying cardholder name, masked card number, expiry, and a chip graphic with front/back faces toggled on click.",
  "frontend/src/components/WithdrawForm.tsx": "A form for submitting withdrawal requests that validates the amount, shows a confirmation dialog, and navigates home after a successful withdrawal mutation.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBalance.ts": "A React Query hook that fetches the current user's account balance from the backend actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useFilteredTransactions.ts": "A hook that manages filter-by-type and sort-by state, returning a memoized filtered and sorted subset of the provided transactions array.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for account initialization, deposit, withdrawal, and transfer operations, invalidating balance and transaction caches on success.",
  "frontend/src/hooks/useTransactions.ts": "Exports a React Query hook that fetches the list of transactions from the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to fetch and save the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles and CSS custom properties for the BlueStone Bank dark-navy/gold design system, including light/dark themes and card-flip animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying balance, virtual card, accounts overview, quick actions, and recent transactions, with automatic account initialization if needed.",
  "frontend/src/pages/DepositPage.tsx": "Page that renders the DepositForm component with a back-navigation button for adding funds to the wallet.",
  "frontend/src/pages/TransactionHistory.tsx": "Page that displays a filterable and sortable table of all user transactions fetched from the backend.",
  "frontend/src/pages/TransferPage.tsx": "Page that renders the TransferForm component with a back-navigation button for sending funds to another user.",
  "frontend/src/pages/WithdrawPage.tsx": "Page that renders the WithdrawForm component with a back-navigation button for removing funds from the wallet.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency amounts (bigint cents to USD string), nanosecond timestamps to locale date strings, and capitalizing transaction type labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/src/utils/validation.ts": "Provides validation functions for amount, Principal ID, and email inputs, each returning a ValidationResult object with an isValid flag and optional error message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (navy, gold, chart palette), border radii, box shadows, fonts, and keyframe animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current state of the BlueStone Bank app project, listing implemented features (dashboard balance, virtual card, quick actions, transactions, multi-account overview), architectural notes, known issues, and image requirements."
}