{
  "backend/main.mo": "Main Motoko actor implementing a banking backend with user profile management and balance operations (deposit, withdraw, transfer), protected by role-based access control via AccessControl and MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting that the demo user credentials in useEmailPasswordAuth.ts were updated to email 'bryanbarton45@gmail.com' and password 'alinalaura@24'.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and key changes of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the BlueStone Bank frontend app, mounting the React app at the #root div and loading the main.tsx module.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with 8 routes (/,  /login, /register, /deposit, /withdraw, /transfer, /transactions, /accounts), email/password session auth, QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/AccountsOverview.tsx": "Displays a checking account summary card with live balance fetched via useBalance, a masked account number, and an informational note about real-time balance updates.",
  "frontend/src/components/BalanceCard.tsx": "Balance display card with show/hide toggle, optional personalized welcome greeting using the userName prop, decorative styling, and a formatted currency balance.",
  "frontend/src/components/DebitCard.tsx": "Visual debit card component showing a styled card with chip, BlueStone Bank branding, toggleable card number, cardholder name, expiry, and a VISA logo.",
  "frontend/src/components/DepositForm.tsx": "A form component for depositing funds that validates the amount, shows quick-select buttons, and triggers a confirmation dialog before submitting via the useDeposit mutation hook.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapper providing a sticky header with navigation links and login button, a mobile hamburger menu, main content slot, and a footer with social links.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/MobileBalanceCard.tsx": "Displays a greeting and the user's checking account balance with a toggle to show or hide the balance value, using the useBalance hook.",
  "frontend/src/components/MobileBottomNav.tsx": "A fixed bottom navigation bar for mobile with Home, Accounts, Pay, and More tabs that navigate to routes or show a 'coming soon' toast for unimplemented features.",
  "frontend/src/components/MobileQuickActions.tsx": "A grid of four quick-action buttons (Deposit, Withdraw, Transfer, Pay Bills) that navigate to their respective routes or show a 'coming soon' toast.",
  "frontend/src/components/MobileRecentTransactions.tsx": "Shows the five most recent transactions with icons, descriptions, relative dates, and color-coded amounts, including skeleton loading states and an empty state.",
  "frontend/src/components/MobileTopBar.tsx": "A sticky mobile header displaying the BlueStone Bank brand, a notification bell with a badge, and optional logout button.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email on first login, validates inputs, and saves the profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/QuickActions.tsx": "Renders a 4-button quick actions grid (Transfer, Deposit, Bill Pay, Top-up) that navigates to routes or shows a 'Coming Soon' toast for unimplemented features.",
  "frontend/src/components/RecentTransactionsList.tsx": "Displays a list of recent transactions with icons, amounts, and dates, showing skeletons while loading and a 'View All' link to the transactions page.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "An alert dialog that shows a summary of a pending deposit, withdrawal, or transfer and lets the user confirm or cancel, with a loading spinner during processing.",
  "frontend/src/components/TransactionFilters.tsx": "Renders two Select dropdowns for filtering transactions by type (all/deposit/withdrawal/transfer) and sorting by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "Displays a paginated list of transactions with icons, badges, descriptions, dates, and color-coded amounts, with an empty state when no transactions match.",
  "frontend/src/components/TransferForm.tsx": "A form for transferring funds to another user by Principal ID, with amount/principal validation, balance checking, and a confirmation dialog before executing the transfer.",
  "frontend/src/components/VirtualCard.tsx": "Renders a flippable virtual debit card UI showing cardholder name, masked card number, expiry, and a styled back face with CVV on click.",
  "frontend/src/components/WithdrawForm.tsx": "A form component for withdrawing funds that validates the amount against the available checking balance, shows a confirmation dialog, and calls the withdraw mutation with success/error toast notifications.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBalance.ts": "A hook that fetches the user's checking balance from the backend actor via React Query, returning a default balance if no data is available yet.",
  "frontend/src/hooks/useEmailPasswordAuth.ts": "Provides email/password authentication utilities (login, register, session management) using localStorage with a simple djb2 hash, including a seeded demo account.",
  "frontend/src/hooks/useFilteredTransactions.ts": "A memoized hook that filters and sorts a list of local transactions by type and a chosen sort option (date or amount, ascending or descending).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout state and identity to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for deposit, withdraw, and external transfer operations against the backend actor, invalidating the balance query on success.",
  "frontend/src/hooks/useTransactions.ts": "Defines transaction types and returns a static list of mock transactions (deposits, withdrawals, transfers) for UI display purposes.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to read and save a local user profile (name and email) stored in localStorage, since the backend has no profile storage.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, a Chase Bank-inspired CSS custom property color system for light and dark modes, and utility styles for card flip animation, balance blur, and custom scrollbar.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AccountsPage.tsx": "Page component displaying the user's accounts overview with a navy header, back navigation to home, and a bottom nav bar.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing the user's balance card, debit card, quick actions, and recent transactions with a sticky top bar and bottom nav.",
  "frontend/src/pages/DepositPage.tsx": "Page wrapping the DepositForm component with a navy header and back navigation, redirecting home on success.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form that authenticates via loginWithEmailPassword and calls onLoginSuccess on valid credentials.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with a validated form for name, email, and password that creates a new account via registerWithEmailPassword and redirects to login on success.",
  "frontend/src/pages/TransactionHistory.tsx": "Paginated transaction history page with type and sort filters, using useTransactions and useFilteredTransactions hooks to display results in a TransactionTable.",
  "frontend/src/pages/TransferPage.tsx": "Page wrapping the TransferForm component with a navy header and back navigation, redirecting home on success.",
  "frontend/src/pages/WithdrawPage.tsx": "Page wrapping the WithdrawForm component with a navy header and back navigation, redirecting home on success.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (cents to USD), timestamps (nanoseconds to readable dates), relative dates, and transaction type labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/src/utils/validation.ts": "Validation functions for amount, Principal ID, and email fields, returning error message strings or empty string on success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (including Chase Bank tokens), fonts, border radii, shadows, and animations. Enables dark mode via class and includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks project metadata and state for the BlueStone Bank app, including schema version, existing features, and a note that the demo user credentials are bryanbarton45@gmail.com / alinalaura@24."
}