{
  "backend/main.mo": "Main Motoko actor implementing a mobile banking backend with user profile management, wallet operations (deposit, withdraw, transfer), and role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard top bar, balance card, quick actions, recent transactions, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of every frontend source file, serving as a quick reference for the purpose and contents of each component, page, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell titled 'BlueStone Bank' that mounts the React app at the #root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, handles authentication via Internet Identity and hardcoded demo credentials, and renders a two-panel login portal before granting dashboard access.",
  "frontend/src/components/AccountsOverview.tsx": "Displays a two-card grid showing live checking balance (fetched from backend) and a dummy savings balance, each styled with dark navy gradients, masked account numbers, and accent-colored icons.",
  "frontend/src/components/BalanceCard.tsx": "Displays a styled balance card with a toggle to show/hide the formatted balance amount, user greeting, and decorative UI elements.",
  "frontend/src/components/DepositForm.tsx": "Form component for submitting a deposit with amount and description fields, including validation and a confirmation dialog before executing the mutation.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapper providing a sticky header with navigation links and login button, responsive mobile menu, main content area, and a footer.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate loading, login, or logout states.",
  "frontend/src/components/MobileBalanceCard.tsx": "Mobile-specific balance card that fetches and displays the user's balance and greeting with a loading skeleton state.",
  "frontend/src/components/MobileBottomNav.tsx": "Fixed bottom navigation bar for mobile with Home, Accounts, Payments, and More tabs, navigating to routes or showing a coming-soon toast.",
  "frontend/src/components/MobileQuickActions.tsx": "Mobile quick-action buttons for Transfer, Deposit, Withdraw, and Pay Bills, navigating to routes or showing a coming-soon toast.",
  "frontend/src/components/MobileRecentTransactions.tsx": "Displays the five most recent transactions on mobile with type-specific icons, relative dates, and loading skeletons, linking to the full transaction history.",
  "frontend/src/components/MobileTopBar.tsx": "Mobile top bar displaying a hamburger menu button, centered brand name, and a notification bell with an unread count badge.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for new users to create their profile by entering name, email, and password, with validation and submission via the useSaveCallerUserProfile hook.",
  "frontend/src/components/QuickActions.tsx": "Renders a grid of quick-action buttons (Transfer, Deposit, Bill Pay, Top-up) that navigate to routes or show a 'coming soon' toast.",
  "frontend/src/components/RecentTransactionsList.tsx": "Displays a list of recent transactions with icons, amounts, and dates, showing skeletons while loading and a 'View All' link to the transactions page.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "An alert dialog that shows a summary of a pending transaction (type, amount, recipient, description) and lets the user confirm or cancel it.",
  "frontend/src/components/TransactionFilters.tsx": "Provides two select dropdowns for filtering transactions by type and sorting them by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "Renders a paginated table of transactions with type icons, badges, descriptions, dates, and color-coded amounts.",
  "frontend/src/components/TransferForm.tsx": "A form for initiating a fund transfer by entering a recipient Principal ID, amount, and optional description, with validation and a confirmation dialog before submission.",
  "frontend/src/components/VirtualCard.tsx": "Renders a flippable virtual bank card UI component showing cardholder name, masked card number, expiry, and a styled back face with CVV strip.",
  "frontend/src/components/WithdrawForm.tsx": "Form component for submitting a withdrawal with amount and optional description, including validation and a confirmation dialog before executing the mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBalance.ts": "Custom hook that fetches the user's account balance from the backend actor using React Query.",
  "frontend/src/hooks/useFilteredTransactions.ts": "Custom hook that provides client-side filtering by transaction type and sorting of a transactions array, returning derived state and setters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutations for account initialization, deposit, withdrawal, and transfer operations, each invalidating balance and transaction caches on success.",
  "frontend/src/hooks/useTransactions.ts": "Custom hook that fetches the list of transactions from the backend actor using React Query.",
  "frontend/src/hooks/useUserProfile.ts": "Custom hooks for fetching and saving the caller's user profile via React Query, with loading state derived from both actor and query status.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base layers, a BlueStone Bank dark-navy-and-gold CSS custom property theme for light and dark modes, and card flip/balance blur animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches balance and transactions, auto-initializes new accounts, and renders a mobile banking layout with top bar, balance card, quick actions, recent transactions, and bottom navigation.",
  "frontend/src/pages/DepositPage.tsx": "Deposit page with a back-to-dashboard button and a card container wrapping the DepositForm component.",
  "frontend/src/pages/TransactionHistory.tsx": "Transaction history page that fetches all transactions, applies filtering/sorting via useFilteredTransactions, and renders them in a TransactionTable with TransactionFilters controls.",
  "frontend/src/pages/TransferPage.tsx": "Transfer page with a back-to-dashboard button and a card container wrapping the TransferForm component.",
  "frontend/src/pages/WithdrawPage.tsx": "Withdraw page with a back-to-dashboard button and a card container wrapping the WithdrawForm component.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting bigint values as USD currency, nanosecond timestamps as human-readable dates, and capitalizing transaction type strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL/hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without page reload.",
  "frontend/src/utils/validation.ts": "Validation helpers for amount strings, ICP Principal IDs, and email addresses, each returning a ValidationResult with an optional error message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom oklch-based colors (navy, gold, semantic tokens), border radii, box shadows, fonts, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest describing the Bluestone Bank mobile banking app's version, architectural notes, and implemented features such as the dashboard layout, balance card, quick actions, and recent transactions."
}