{
  "kind": "build_request",
  "title": "BlueStone Bank Full Dashboard with Virtual Card and Quick Actions",
  "projectName": "BlueStone Bank",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Redesign the Dashboard page to display a modern bank home layout with a prominently featured account balance section at the top, including a show/hide toggle button to mask/unmask the balance amount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Account balance display with show/hide toggle",
          "Account balance prominently displayed at the top (with show/hide toggle)"
        ]
      },
      "acceptanceCriteria": [
        "Balance is displayed prominently at the top of the dashboard",
        "A toggle button hides/shows the balance (masked as ••••••)",
        "Balance updates correctly when fetched from the backend"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an interactive virtual debit card component to the dashboard that displays masked card number (•••• •••• •••• 1234), the user's name, expiry date, and BlueStone Bank branding. The card should flip on click/tap to reveal card details on the back (CVV area, card network logo).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Virtual card with masked number (•••• •••• •••• 1234) and flip interaction",
          "Virtual card display with masked card number and flip interaction"
        ]
      },
      "acceptanceCriteria": [
        "Virtual card is rendered with masked PAN, name, expiry, and bank branding",
        "Clicking or tapping the card triggers a smooth 3D flip animation",
        "Card back shows CVV placeholder and card network logo",
        "Card uses BlueStone Bank color scheme"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the existing QuickActions component with an expanded set of four quick action buttons on the dashboard: Transfer, Deposit, Bill Pay, and Top-up. Each button should have a distinct icon, label, and color accent. Bill Pay and Top-up can show a 'Coming Soon' toast since backend support is not yet implemented.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Quick action buttons: Transfer, Deposit, Bill Pay, Top-up",
          "Quick action buttons — Transfer, Deposit, Bill Pay, Top-up"
        ]
      },
      "acceptanceCriteria": [
        "Four quick action buttons are displayed: Transfer, Deposit, Bill Pay, Top-up",
        "Transfer and Deposit navigate to their respective pages",
        "Bill Pay and Top-up display a 'Coming Soon' toast notification",
        "Each button has a unique icon and color accent"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the RecentTransactionsList component to display a richer activity feed styled like a modern banking app — showing transaction type icon, merchant/description, date, and color-coded amount (green for credits, red for debits). Show at least 5 recent transactions with a 'View All' link to the full history page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Recent transactions / activity feed with realistic dummy data",
          "Recent transactions / Activity feed with a scrollable list of realistic dummy transactions"
        ]
      },
      "acceptanceCriteria": [
        "Activity feed shows up to 5 most recent transactions",
        "Each row displays icon, description, date, and signed amount",
        "Credits are shown in green, debits in red",
        "A 'View All' link navigates to the full transaction history page",
        "Loading skeleton is displayed while data is fetching"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a multiple accounts overview section to the dashboard showing at least two account cards: a Checking account and a Savings account, each displaying account type label, a partial masked account number, and a balance. Use realistic dummy data for the Savings account while the Checking account reflects the live backend balance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Multiple account overview (Checking + Savings)",
          "Multiple accounts overview (Checking, Savings overview)"
        ]
      },
      "acceptanceCriteria": [
        "Two account cards are visible: Checking and Savings",
        "Each card shows account type, masked account number, and balance",
        "Checking account balance is sourced from the backend",
        "Savings account uses realistic dummy data",
        "Cards are styled consistently with the BlueStone Bank theme"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the login page retains its professional BlueStone Bank design with email field, password field, Remember Me checkbox, Forgot Password link, Sign In button, and a navigation path that leads to the new dashboard upon successful authentication.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Login Page — Professional design with email, password, Remember Me, and Forgot Password"
        ]
      },
      "acceptanceCriteria": [
        "Login page shows email input, password input, Remember Me checkbox, and Forgot Password link",
        "Sign In button is present and triggers Internet Identity authentication",
        "Successful login navigates user to the new bank dashboard",
        "BlueStone Bank branding is consistent"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Apply a cohesive modern banking visual theme throughout the dashboard — use a dark navy or deep charcoal primary palette with gold/amber accent colors, clean card-based layout with subtle shadows, premium typography, and smooth micro-animations on interactions (card flip, balance toggle, button hover).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "make it look more like a real bank",
          "Professional BlueStone Bank branding consistent with the login page"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard uses a dark navy or deep charcoal primary palette with gold/amber accents",
        "All cards have consistent border-radius and subtle drop shadows",
        "Micro-animations are applied to the card flip, balance toggle, and button hover states",
        "Typography is clean and professional throughout",
        "Theme is consistent between the login page and dashboard"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All backend logic must remain in the single Motoko actor at backend/main.mo",
    "Bill Pay and Top-up features should not require new backend endpoints — show 'Coming Soon' UI only"
  ],
  "nonGoals": [
    "Real payment processing or external banking API integration",
    "Bill Pay and Top-up backend functionality",
    "Multi-user admin or bank manager views",
    "Real-time transaction updates via WebSockets",
    "Mobile app or React Native version"
  ],
  "imageRequirements": {
    "required": [
      "BlueStone Bank virtual debit card illustration in dark navy with gold accents, showing chip, card network logo placeholder, and subtle geometric pattern (virtual-card-bg.dim_600x380.png)"
    ],
    "edits": []
  }
}