{
  "backend/main.mo": "Main actor implementing wallet and user profile management with access control, including deposit/withdraw/transfer operations, transaction history, and password management.",
  "backend/migration.mo": "Migration module that transforms old user profiles (name only) to new profiles with email and password fields, initializing empty strings for new fields.",
  "feature_evidence.json": "Feature evidence report documenting the addition of email and password fields to the login interface for credential-based authentication.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, hooks, and utilities including authentication, profile setup, wallet operations, and styling with warm neutral color palette.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm neutral palette (beige, soft gold, charcoal).",
  "frontend/index.html": "HTML entry point with BlueStone Bank title and root div for React application mounting.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication flow, profile setup modal trigger, and login portal with BlueStone Bank branding.",
  "frontend/src/components/BalanceCard.tsx": "Card component displaying current wallet balance with gradient background, wallet icon, and formatted currency display.",
  "frontend/src/components/DepositForm.tsx": "Deposit form with amount and description inputs, validation, confirmation dialog, and success/error toast notifications.",
  "frontend/src/components/Layout.tsx": "Application layout with header (BlueStone Bank branding, motto, navigation), mobile menu, login button, and footer with social links and attribution.",
  "frontend/src/components/LoginButton.tsx": "A button component that toggles between login and logout states using Internet Identity, displaying appropriate icons and loading states while managing authentication and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time user profile setup that collects name, email, and password with validation, preventing dismissal until profile creation is complete.",
  "frontend/src/components/QuickActions.tsx": "A card component displaying three quick action buttons (Deposit, Withdraw, Transfer) with icons and color-coded styling that navigate to their respective pages.",
  "frontend/src/components/RecentTransactionsList.tsx": "Displays a card with the most recent transactions showing type icons, descriptions, timestamps, and amounts with color-coded formatting, including loading states and empty state messaging.",
  "frontend/src/components/TransactionConfirmationDialog.tsx": "An alert dialog that displays transaction details (type, amount, recipient, description) for user confirmation before processing deposit, withdrawal, or transfer operations.",
  "frontend/src/components/TransactionFilters.tsx": "A card component with two dropdown selects for filtering transactions by type (all/deposit/withdrawal/transfer) and sorting by date or amount.",
  "frontend/src/components/TransactionTable.tsx": "A table component that displays transactions with type icons, descriptions, dates, and color-coded amounts, showing an empty state when no transactions exist.",
  "frontend/src/components/TransferForm.tsx": "A form for transferring funds to another user by Principal ID with amount and description fields, including validation and a confirmation dialog before submission.",
  "frontend/src/components/WithdrawForm.tsx": "React form component for withdrawing funds with amount and description inputs, validation, and a confirmation dialog before submitting the withdrawal mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with authentication, initializing it with the user's identity and admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBalance.ts": "Custom hook that fetches the user's account balance from the backend actor using React Query.",
  "frontend/src/hooks/useFilteredTransactions.ts": "Custom hook that provides filtering by transaction type and sorting by date/amount for a list of transactions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for managing Internet Identity authentication, including login, logout, identity state, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Custom hooks for account mutations (initialize, deposit, withdraw, transfer) that invalidate balance and transaction queries on success.",
  "frontend/src/hooks/useTransactions.ts": "Custom hook that fetches the user's transaction history from the backend actor using React Query.",
  "frontend/src/hooks/useUserProfile.ts": "Custom hooks for fetching and saving the caller's user profile with React Query, invalidating the profile cache on updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color palette (beige, soft gold, charcoal) for both light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying account balance, quick actions, and recent transactions with automatic account initialization if needed.",
  "frontend/src/pages/DepositPage.tsx": "Dedicated page for depositing funds with a back button and the DepositForm component.",
  "frontend/src/pages/TransactionHistory.tsx": "Page displaying a filterable and sortable table of all user transactions with loading and error states.",
  "frontend/src/pages/TransferPage.tsx": "Page component that renders a transfer funds form with a back button to navigate to the dashboard.",
  "frontend/src/pages/WithdrawPage.tsx": "Page component that renders a withdraw funds form with a back button to navigate to the dashboard.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (bigint to USD), dates (timestamp to readable format), and transaction types (capitalize first letter).",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support and parameter cleanup functions.",
  "frontend/src/utils/validation.ts": "Validation functions for amounts, Principal IDs, and email addresses, returning structured validation results with error messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended utilities for borders/shadows/fonts, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking BlueStone Bank application state, existing features for authentication, and pending feature requests for email/password credential management."
}